app/views/exchange/_header.html.haml

          %li#pairs-dropdown.dropdown
            %a.selected.dropdown-toggle.token-link{"aria-expanded" => "false", "aria-haspopup" => "true", "data-toggle" => "dropdown", :href => "javascript:void(0)", :role => "button"}
---
SELECT  `tokens`.* FROM `tokens` WHERE (symbol = 'ZRX') ORDER BY `tokens`.`id` ASC LIMIT 1