app/controllers/exchange_controller.rb

  def trade
    base_token = params[:trade_pair].split("-")[1]
    token_symbol = params[:trade_pair].split("-")[0]

    @refer_id = $refer_id
    @base_token = base_token
    # Get messages
    @messages = Message.order(updated_at: :asc)
    # ETH token table
    @tokenlist = get_token_list
    # TM token table
    @tmtokenlist = Token.where("tm_field = ?", 1).order(symbol: :asc)

    token = Token.where("symbol = ?",token_symbol).first
    if token
      @zrxtoken = token
      buy_orders = Order.select("type,price,sum(amount) as amount, min(expire) as expire").where(base_token:base_token,token_symbol:token_symbol,type:1).group("price").order(price: :desc)
      sell_orders = Order.select("type,price,sum(amount) as amount, min(expire) as expire").where(base_token:base_token,token_symbol:token_symbol,type:0 ).group("price").order(price: :asc)
      # max_amount = Order.select("sum(amount) as amount").where(base_token:base_token,token_symbol:token_symbol).maximum("amount")
      buy_max = Order.select("sum(amount) as mamount").where(base_token:base_token,token_symbol:token_symbol,type:1).group("price").order("mamount DESC").first
      sell_max = Order.select("sum(amount) as mamount").where(base_token:base_token,token_symbol:token_symbol,type:0).group("price").order("mamount DESC").first
      best_asks = Order.where(base_token:base_token,token_symbol:token_symbol,type:0).minimum("price");
      best_bids = Order.where(base_token:base_token,token_symbol:token_symbol,type:1).maximum("price");
---
SELECT  `tokens`.* FROM `tokens` WHERE (symbol = 'ZRX') ORDER BY `tokens`.`id` ASC LIMIT 1
SELECT type,price,sum(amount) as amount, min(expire) as expire FROM `orders` WHERE `orders`.`base_token` = 'WETH' AND `orders`.`token_symbol` = 'ZRX' AND `orders`.`type` = 1 GROUP BY `orders`.`price` ORDER BY `orders`.`price` DESC
SELECT  sum(amount) as mamount FROM `orders` WHERE `orders`.`base_token` = 'WETH' AND `orders`.`token_symbol` = 'ZRX' AND `orders`.`type` = 0 GROUP BY `orders`.`price` ORDER BY mamount DESC LIMIT 1
SELECT MAX(`orders`.`price`) FROM `orders` WHERE `orders`.`base_token` = 'WETH' AND `orders`.`token_symbol` = 'ZRX' AND `orders`.`type` = 1

        @sell_orders.push json_record
      end

      trade_histories = TradeHistory.where(base_token:base_token,token_symbol:token_symbol).order(updated_at: :desc)
---
SELECT `trade_histories`.* FROM `trade_histories` WHERE `trade_histories`.`base_token` = 'WETH' AND `trade_histories`.`token_symbol` = 'ZRX' ORDER BY `trade_histories`.`updated_at` DESC

  def get_init_data
    base_token = params[:base_token]
    symbol = params[:token_symbol]
    token_addr = params[:token_address]
    tokens = get_token_list
    tm_tokens = Token.where("tm_field = ?", 1).order(symbol: :asc)
---
SELECT  price,type FROM `orders` WHERE (base_token = 'WETH' AND token_symbol = 'ZRX') ORDER BY `orders`.`id` DESC LIMIT 1

  def token_h_price(base_token = "ETH", token_symbol)
    h_price = TradeHistory.where("created_at > ? AND token_symbol = ?",Time.now.midnight,token_symbol).last
---
SELECT  `trade_histories`.* FROM `trade_histories` WHERE (created_at < '2018-09-25 17:00:00' AND token_symbol = 'TKN0' AND base_token = 'WETH') ORDER BY `trade_histories`.`created_at` DESC LIMIT 1

  def token_h_volumn(base_token = "ETH", token_symbol)
    volumns = TradeHistory.where("created_at > ? AND token_symbol = ?",Time.now.midnight,token_symbol)
    h_volumn = 0.00
    if volumns.length > 0
---
SELECT  `trade_histories`.* FROM `trade_histories` WHERE (created_at < '2018-09-30 17:00:00' AND token_symbol = 'B0X' AND base_token = 'WETH') ORDER BY `trade_histories`.`created_at` DESC LIMIT 1

  def get_messages
    room_id = params[:param1]
    messages = Message.where(room_id: room_id ).order(created_at: :asc)
---
SELECT `messages`.* FROM `messages` WHERE `messages`.`room_id` = 1 ORDER BY `messages`.`created_at` ASC

  def get_my_open_orders
    wallet_address = params[:wallet_addr]
    base_token = params[:base_token]
    token_symbol = params[:token_symbol]
    my_orders = Order.where(base_token:base_token,maker_address:wallet_address).order(created_at: :asc)
    if my_orders.length > 0
---
SELECT `orders`.* FROM `orders` WHERE `orders`.`base_token` = 'WETH' AND `orders`.`maker_address` = '0x3360debda575e4564709bbb3b098627444a7b191' ORDER BY `orders`.`created_at` ASC
SELECT  price,type FROM `orders` WHERE (base_token = 'WETH' AND token_symbol = 'B0X') ORDER BY `orders`.`id` DESC LIMIT 1

  def get_orders
    token_symbol = params[:symbol]
    base_token = params[:base_token]
    last_order = Order.select("price,type").where("base_token = ? AND token_symbol = ?",base_token,token_symbol).last
    if last_order
      if last_order.type == 1
        match_order = Order.where("base_token = ? AND token_symbol = ? AND price <= ? AND type = ?",base_token,token_symbol,last_order.price,0).order(price: :desc)
      elsif last_order.type == 0
        match_order = Order.where("base_token = ? AND token_symbol = ? AND price >= ? AND type = ?",base_token,token_symbol,last_order.price,1).order(price: :desc)
      end
    else
      matched = 0
    end
    if match_order
      if match_order.length > 0
        matched = 1
      else
        matched = 0
      end
    else
      matched = 0
    end
    last_day_trade = TradeHistory.where("created_at < ? AND token_symbol = ? AND base_token = ?",Time.now.midnight,token_symbol,base_token).order(created_at: :asc).last
---
SELECT MIN(`orders`.`price`) FROM `orders` WHERE `orders`.`base_token` = 'WETH' AND `orders`.`token_symbol` = 'TKN0' AND `orders`.`type` = 0
SELECT type,price,sum(amount) as amount, min(expire) as expire FROM `orders` WHERE `orders`.`base_token` = 'WETH' AND `orders`.`token_symbol` = 'TKN0' AND `orders`.`type` = 1 GROUP BY `orders`.`price` ORDER BY `orders`.`price` DESC
SELECT  `trade_histories`.* FROM `trade_histories` WHERE (created_at < '2018-09-25 17:00:00' AND token_symbol = 'TKN0' AND base_token = 'WETH') ORDER BY `trade_histories`.`created_at` DESC LIMIT 1

  def get_trade_history
    symbol = params[:symbol]
    base_token = params[:base_token]
    trade_histories = TradeHistory.where(base_token:base_token,token_symbol:symbol).order(updated_at: :desc)
---
SELECT `trade_histories`.* FROM `trade_histories` WHERE `trade_histories`.`base_token` = 'WETH' AND `trade_histories`.`token_symbol` = 'ZRX' ORDER BY `trade_histories`.`updated_at` DESC

  def get_reward
    user_wallet_address = params[:wallet_address]

    trades = TradeHistory.where("base_token = ? AND reward_status IS NULL AND (maker_address = ? OR taker_address = ?)","WETH",user_wallet_address,user_wallet_address).order(created_at: :asc)
---
SELECT `trade_histories`.* FROM `trade_histories` WHERE (maker_address = '0xb0881b938ebcecaa12391b3c189b39f5268a5abd' OR taker_address = '0xb0881b938ebcecaa12391b3c189b39f5268a5abd') ORDER BY `trade_histories`.`created_at` ASC