app/controllers/exchange_controller.rb

SELECT `tokens`.* FROM `tokens` WHERE (symbol != 'WETH') ORDER BY `tokens`.`symbol` ASC
---
  def get_tokens
    base_token = params[:base_token]
    tokens = Token.order(symbol: :asc)

SELECT  `trade_histories`.* FROM `trade_histories` WHERE (created_at < '2018-09-30 17:00:00' AND token_symbol = 'TKN1' AND base_token = 'WETH') ORDER BY `trade_histories`.`created_at` DESC LIMIT 1
---
  def token_last_price(base_token = 'ETH', token_symbol)
    last = TradeHistory.where(token_symbol:token_symbol).last