app/controllers/user_sessions_controller.rb

  def user_login
    if params[:login_type] == 'META_MASK'
      wallet_address = params[:wallet_address]
      nick_name = params[:nick_name]
      refer_id = params[:refer_id]
      @user = User.find_by wallet_address: wallet_address
---
SELECT  `users`.* FROM `users` WHERE `users`.`wallet_address` = '0x3360debda575e4564709bbb3b098627444a7b191' LIMIT 1

  def get_user
    @user = User.find_by wallet_address: params[:wallet_address]
---
SELECT  `users`.* FROM `users` WHERE `users`.`wallet_address` = '0x3360debda575e4564709bbb3b098627444a7b191' LIMIT 1