app/models/token.rb

SELECT  `trade_histories`.* FROM `trade_histories` WHERE `trade_histories`.`token_symbol` = 'WETH' AND `trade_histories`.`base_token` = 'WETH' ORDER BY `trade_histories`.`id` DESC LIMIT 1
---
  def last_price(based_token='WETH')
    last = TradeHistory.where(token_symbol:self.symbol,base_token:based_token).last

SELECT  `trade_histories`.* FROM `trade_histories` WHERE (created_at > '2018-09-21 17:00:00' AND token_symbol = 'B0X' AND base_token = 'B0X') ORDER BY `trade_histories`.`id` DESC LIMIT 1
---
  def h_price(based_token='WETH')
    h_price = TradeHistory.where("created_at > ? AND token_symbol = ? AND base_token = ?",Time.now.midnight,self.symbol,based_token).last

SELECT `trade_histories`.* FROM `trade_histories` WHERE (created_at > '2018-09-25 17:00:00' AND token_symbol = 'B0X' AND base_token = 'B0X')
SELECT `trade_histories`.* FROM `trade_histories` WHERE (created_at > '2018-09-21 17:00:00' AND token_symbol = 'B0X' AND base_token = 'B0X')
---
  def h_volumn(based_token='WETH')
    volumns = TradeHistory.where("created_at > ? AND token_symbol = ? AND base_token = ?",Time.now.midnight,self.symbol,based_token)
    h_volumn = 0.00
    if volumns.length > 0